yuri-tnk/TNKernel_v3/common_cortex/src/system_stm32f746.c
  /*------------------------------- HSE Configuration ------------------------*/ 
  if(((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_HSE) == RCC_OSCILLATORTYPE_HSE)
  {
    /* Check the parameters */
     assert_param(IS_RCC_HSE(RCC_OscInitStruct->HSEState));

    /* When the HSE is used as system clock or clock source for PLL, 
      It can not be disabled */

     if((__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_HSE) 
          || ((__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_PLLCLK) && 
                ((RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC) == RCC_PLLCFGR_PLLSRC_HSE)))
     {
 	     if((__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) != /*RESET*/ 0UL) && 
            (RCC_OscInitStruct->HSEState == RCC_HSE_OFF))
        {
           return HAL_ERROR;
        }
     }
     else
     {
      /* Reset HSEON and HSEBYP bits before configuring the HSE --------------*/

        __HAL_RCC_HSE_CONFIG(RCC_HSE_OFF);
      
      /* Wait till HSE is disabled */  
        tickstart = 0UL;
        while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) != 0UL)//RESET)
        {
           if(tickstart > HSE_TIMEOUT_VALUE)
           {
              return HAL_TIMEOUT;
           }
           delay_1ms();
           tickstart++;
        }
      
      /* Set the new HSE configuration ---------------------------------------*/
        __HAL_RCC_HSE_CONFIG(RCC_OscInitStruct->HSEState);
      
      /* Check the HSE State */
        if(RCC_OscInitStruct->HSEState != RCC_HSE_OFF)
        {
           /* Wait till HSE is ready */  
           tickstart = 0UL;
           while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) == 0UL/*RESET*/)
           {
              if(tickstart > HSE_TIMEOUT_VALUE)
              {
                 return HAL_TIMEOUT;
              }
              delay_1ms();
              tickstart++;
           }
        }
        else
        {
           /* Wait till HSE is bypassed or disabled */
           tickstart = 0UL;
           while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) != RESET)
           {
              if(tickstart > HSE_TIMEOUT_VALUE)
           {
              return HAL_TIMEOUT;
           }
           delay_1ms();
           tickstart++;
        }
      }
    }
  }
  /*----------------------------- HSI Configuration --------------------------*/ 
  if(((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_HSI) == 
               RCC_OSCILLATORTYPE_HSI)
  {
    /* Check the parameters */
    assert_param(IS_RCC_HSI(RCC_OscInitStruct->HSIState));
    assert_param(IS_RCC_CALIBRATION_VALUE(RCC_OscInitStruct->HSICalibrationValue));
    
    /* Check if HSI is used as system clock or as PLL source when PLL is selected as system clock */ 
    if((__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_HSI) 
       || ((__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_PLLCLK) && 
            ((RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC) == RCC_PLLCFGR_PLLSRC_HSI)))
    {
      /* When HSI is used as system clock it will not disabled */
      if((__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY) != RESET) && 
            (RCC_OscInitStruct->HSIState != RCC_HSI_ON))
      {
        return HAL_ERROR;
      }
      /* Otherwise, just the calibration is allowed */
      else
      {
        /* Adjusts the Internal High Speed oscillator (HSI) calibration value.*/
        __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(RCC_OscInitStruct->HSICalibrationValue);
      }
    }
    else
    {
      /* Check the HSI State */
      if((RCC_OscInitStruct->HSIState)!= RCC_HSI_OFF)
      {
        /* Enable the Internal High Speed oscillator (HSI). */
        __HAL_RCC_HSI_ENABLE();


        /* Wait till HSI is ready */  
        tickstart = 0UL;
        while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY) == RESET)
        {
           if(tickstart > HSI_TIMEOUT_VALUE)
           {
              return HAL_TIMEOUT;
           }
           delay_1ms();
           tickstart++;
        }
                
        /* Adjusts the Internal High Speed oscillator (HSI) calibration value.*/
        __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(RCC_OscInitStruct->HSICalibrationValue);
      }
      else
      {
        /* Disable the Internal High Speed oscillator (HSI). */
        __HAL_RCC_HSI_DISABLE();
      
        /* Wait till HSI is ready */  
        tickstart = 0UL;
        while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSIRDY) != RESET)
        {
           if(tickstart > HSI_TIMEOUT_VALUE)
           {
              return HAL_TIMEOUT;
           }
           delay_1ms();
           tickstart++;
        } 
      }
    }
  }
  /*------------------------------ LSI Configuration -------------------------*/
  if(((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_LSI) == 
                   RCC_OSCILLATORTYPE_LSI)
  {
    /* Check the parameters */
    assert_param(IS_RCC_LSI(RCC_OscInitStruct->LSIState));

    /* Check the LSI State */
    if((RCC_OscInitStruct->LSIState)!= RCC_LSI_OFF)
    {
      /* Enable the Internal Low Speed oscillator (LSI). */
      __HAL_RCC_LSI_ENABLE();
      
      
      /* Wait till LSI is ready */
      tickstart = 0UL;
      while(__HAL_RCC_GET_FLAG(RCC_FLAG_LSIRDY) == RESET)
      {
           if(tickstart > LSI_TIMEOUT_VALUE)
           {
              return HAL_TIMEOUT;
           }
           delay_1ms();
           tickstart++;
      }
    }
    else
    {
      /* Disable the Internal Low Speed oscillator (LSI). */
      __HAL_RCC_LSI_DISABLE();
      
      
      /* Wait till LSI is ready */  
      tickstart = 0UL;
      while(__HAL_RCC_GET_FLAG(RCC_FLAG_LSIRDY) != RESET)
      {
           if(tickstart > LSI_TIMEOUT_VALUE)
           {
              return HAL_TIMEOUT;
           }
           delay_1ms();
           tickstart++;
      }
    }
  }
  /*------------------------------ LSE Configuration -------------------------*/ 
  if(((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_LSE) == 
             RCC_OSCILLATORTYPE_LSE)
  {
    /* Check the parameters */
    assert_param(IS_RCC_LSE(RCC_OscInitStruct->LSEState));
    
    /* Enable Power Clock*/
    __HAL_RCC_PWR_CLK_ENABLE();
    
