yuri-tnk/TNKernel_v3/common_cortex/src/system_stm32f746.c
  /*-------------------------- PCLK1 Configuration ---------------------------*/ 
  if(((RCC_ClkInitStruct->ClockType) & RCC_CLOCKTYPE_PCLK1) == RCC_CLOCKTYPE_PCLK1)
  {
    assert_param(IS_RCC_PCLK(RCC_ClkInitStruct->APB1CLKDivider));
    MODIFY_REG(RCC->CFGR, RCC_CFGR_PPRE1, RCC_ClkInitStruct->APB1CLKDivider);
  }
  
  /*-------------------------- PCLK2 Configuration ---------------------------*/ 
  if(((RCC_ClkInitStruct->ClockType) & RCC_CLOCKTYPE_PCLK2) == RCC_CLOCKTYPE_PCLK2)
  {
    assert_param(IS_RCC_PCLK(RCC_ClkInitStruct->APB2CLKDivider));
    MODIFY_REG(RCC->CFGR, RCC_CFGR_PPRE2, ((RCC_ClkInitStruct->APB2CLKDivider) << 3));
  }

  /* Configure the source of time base considering new system clocks settings*/
  (void)HAL_InitTick (TICK_INT_PRIORITY);
  
  return HAL_OK;
}
 
//----------------------------------------------------------------------------
static uint32_t HAL_SYSTICK_Config(uint32_t TicksNumb)
{
   return SysTick_Config(TicksNumb);
} 

//----------------------------------------------------------------------------
static uint32_t HAL_RCC_GetHCLKFreq(void)
{
  RCC_ClocksTypeDef RCC_Clocks;
  SystemCoreClock = HAL_RCC_GetClocksFreq_Ex(&RCC_Clocks) >> 
                          APBAHBPrescTable[(RCC->CFGR & RCC_CFGR_HPRE) >> 
                                POSITION_VAL(RCC_CFGR_HPRE)];
  return SystemCoreClock;
} 

//----------------------------------------------------------------------------
HAL_StatusTypeDef HAL_InitTick(uint32_t TickPriority)
{
  /*Configure the SysTick to have interrupt in 1ms time basis*/
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000UL);

  /*Configure the SysTick IRQ priority */
  HAL_NVIC_SetPriority(SysTick_IRQn, TickPriority, 0UL);

  /* Return function status */
  return HAL_OK;
} 

/**
  * @brief  Returns the SYSCLK frequency
  *        
  * @note   The system frequency computed by this function is not the real 
  *         frequency in the chip. It is calculated based on the predefined 
  *         constant and the selected clock source:
  * @note     If SYSCLK source is HSI, function returns values based on HSI_VALUE(*)
  * @note     If SYSCLK source is HSE, function returns values based on HSE_VALUE(**)
  * @note     If SYSCLK source is PLL, function returns values based on HSE_VALUE(**) 
  *           or HSI_VALUE(*) multiplied/divided by the PLL factors.         
  * @note     (*) HSI_VALUE is a constant defined in stm32f7xx_hal_conf.h file (default value
  *               16 MHz) but the real value may vary depending on the variations
  *               in voltage and temperature.
  * @note     (**) HSE_VALUE is a constant defined in stm32f7xx_hal_conf.h file (default value
  *                25 MHz), user has to ensure that HSE_VALUE is same as the real
  *                frequency of the crystal used. Otherwise, this function may
  *                have wrong result.
  *                  
  * @note   The result of this function could be not correct when using fractional
  *         value for HSE crystal.
  *           
  * @note   This function can be used by the user application to compute the 
  *         baudrate for the communication peripherals or configure other parameters.
  *           
  * @note   Each time SYSCLK changes, this function must be called to update the
  *         right SYSCLK value. Otherwise, any configuration based on this function will be incorrect.
  *         
  *               
  * @retval SYSCLK frequency
  */
uint32_t HAL_RCC_GetClocksFreq_Ex(RCC_ClocksTypeDef * RCC_Clocks)
{
   uint32_t pllm; 
   uint32_t pllvco = 0UL; 
   uint32_t pllp;
   uint32_t sysclockfreq = 0UL;
   uint32_t tmp;
   uint32_t presc;

  /* Get SYSCLK source -------------------------------------------------------*/

   switch (RCC->CFGR & RCC_CFGR_SWS)
   {
      case RCC_SYSCLKSOURCE_STATUS_HSI:  /* HSI used as system clock source */
    
         sysclockfreq = HSI_VALUE;
         break;
    
      case RCC_SYSCLKSOURCE_STATUS_HSE:  /* HSE used as system clock  source */
    
         sysclockfreq = HSE_VALUE;
         break;
    
      case RCC_SYSCLKSOURCE_STATUS_PLLCLK:  /* PLL used as system clock  source */
    
      /* PLL_VCO = (HSE_VALUE or HSI_VALUE / PLLM) * PLLN
         SYSCLK = PLL_VCO / PLLP */

         pllm = RCC->PLLCFGR & RCC_PLLCFGR_PLLM;
         if(__HAL_RCC_GET_PLL_OSCSOURCE() != RCC_PLLCFGR_PLLSRC_HSI)
         {
            if(pllm != 0UL)
            { 
             /* HSE used as PLL clock source */
               pllvco = ((HSE_VALUE / pllm) * ((RCC->PLLCFGR & RCC_PLLCFGR_PLLN) >> POSITION_VAL(RCC_PLLCFGR_PLLN)));
            }
         }
         else
         {
            if(pllm != 0UL)
            { 
            /* HSI used as PLL clock source */
               pllvco = ((HSI_VALUE / pllm) * ((RCC->PLLCFGR & RCC_PLLCFGR_PLLN) >> POSITION_VAL(RCC_PLLCFGR_PLLN)));    
            }  
         }
         pllp = ((((RCC->PLLCFGR & RCC_PLLCFGR_PLLP) >> POSITION_VAL(RCC_PLLCFGR_PLLP)) + 1 ) *2);
      
         if(pllp != 0UL)
         { 
            sysclockfreq = pllvco/pllp;
         }
         break;
    
      default:
    
         sysclockfreq = HSI_VALUE;
         break;
   }

   RCC_Clocks->SYSCLK_Frequency = sysclockfreq;

  /* Compute HCLK, PCLK1 and PCLK2 clocks frequencies ------------------------*/
  
  /* Get HCLK prescaler */
   tmp = RCC->CFGR & RCC_CFGR_HPRE;
   tmp = tmp >> 4UL;
   presc = APBAHBPrescTable[tmp];

  /* HCLK clock frequency */
   RCC_Clocks->HCLK_Frequency = RCC_Clocks->SYSCLK_Frequency >> presc;

  /* Get PCLK1 prescaler */
   tmp = RCC->CFGR & RCC_CFGR_PPRE1;
   tmp = tmp >> 10UL;
   presc = APBAHBPrescTable[tmp];

  /* PCLK1 clock frequency */
   RCC_Clocks->PCLK1_Frequency = RCC_Clocks->HCLK_Frequency >> presc;

  /* Get PCLK2 prescaler */
   tmp = RCC->CFGR & RCC_CFGR_PPRE2;
   tmp = tmp >> 13UL;
   presc = APBAHBPrescTable[tmp];

  /* PCLK2 clock frequency */
   RCC_Clocks->PCLK2_Frequency = RCC_Clocks->HCLK_Frequency >> presc;

